# Taps
tap "tunneltodev/tap"

# CLI tools
brew "aria2"
brew "atuin"
brew "fzf"
brew "gh"
brew "imagemagick"
brew "libyaml"
brew "mas"
brew "mise"
brew "node"
brew "opensearch"
brew "postgresql@18", restart_service: :changed
brew "redis", restart_service: :changed
brew "stow"
brew "tunneltodev/tap/tunnelto"
brew "defaultbrowser"
brew "zsh"

# GUI applications
cask "1password"
cask "1password-cli"
cask "brave-browser"
cask "calendr"
cask "claude"
cask "claude-code"
cask "cleanshot"
cask "docker-desktop"
cask "firefox"
cask "font-fira-code"
cask "github"
cask "httpie-desktop"
cask "lunar"
cask "mac-mouse-fix"
cask "maccy"
cask "notion"
cask "numi"
cask "raycast"
cask "slack"
cask "visual-studio-code"
cask "wezterm"
cask "whatsapp"
cask "zoom"

# Mac App Store
mas "1Password for Safari", id: 1569813296
mas "Amphetamine", id: 937984704
mas "Bear", id: 1091189122
mas "Magnet", id: 441258766
mas "Spark Classic", id: 1176895641
